tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "ryooooooga/tap"
brew "shellcheck"
brew "actionlint"
brew "alejandra"
brew "ansible"
brew "jpeg-xl"
brew "aom"
brew "atuin"
brew "bat"
brew "berkeley-db", link: true
brew "boost"
brew "glib"
brew "gcc"
brew "suite-sparse"
brew "tbb"
brew "hdf5"
brew "cpanminus"
brew "eza"
brew "fastfetch"
brew "fd"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "libass"
brew "libmicrohttpd"
brew "librist"
brew "pango"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "ffmpeg@4"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "ghq"
brew "git"
brew "git-delta"
brew "glances"
brew "glslang"
brew "gobject-introspection"
brew "golangci-lint"
brew "openjdk"
brew "gradle"
brew "guile"
brew "hadolint"
brew "htop"
brew "hugo"
brew "imagemagick"
brew "jq"
brew "just"
brew "latexindent"
brew "lazydocker"
brew "lazygit"
brew "lazysql"
brew "lefthook"
brew "lua"
brew "luv"
brew "micromamba"
brew "mise"
brew "nowplaying-cli"
brew "numpy"
brew "nvm"
brew "openvino"
brew "qt"
brew "pyqt"
brew "vtk"
brew "opencv"
brew "portaudio"
brew "pyenv"
brew "qt@5"
brew "pyqt@5"
brew "python-setuptools"
brew "python@3.12"
brew "ripgrep"
brew "ruby-build"
brew "sevenzip"
brew "sheldon"
brew "shfmt"
brew "starship"
brew "switchaudio-osx"
brew "tmux"
brew "tokei"
brew "tree"
brew "typst"
brew "typstyle"
brew "uv"
brew "vim"
brew "wget"
brew "xh"
brew "yazi"
brew "zoxide"
brew "zsh"
brew "felixkratz/formulae/borders"
brew "ryooooooga/tap/zabrze"
cask "aerospace"
cask "appcleaner"
cask "balenaetcher"
cask "brave-browser"
cask "chatgpt"
cask "claude"
cask "deepl"
cask "discord"
cask "figma"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-monaspace"
cask "font-sf-mono"
cask "font-sf-pro"
cask "google-chrome"
cask "intellij-idea"
cask "keycastr"
cask "logi-options+"
cask "mactex-no-gui"
cask "notion"
cask "obs"
cask "obsidian"
cask "orbstack"
cask "postman"
cask "raycast"
cask "rectangle"
cask "sf-symbols"
cask "slack"
cask "spotify"
cask "unity-hub"
cask "visual-studio-code"
cask "warp"
cask "wezterm"
cask "wireshark"
cask "zed"
cask "zoom"
vscode "13xforever.language-x86-64-assembly"
vscode "3w36zj6.textlint"
vscode "42crunch.vscode-openapi"
vscode "8amjp.charactercount"
vscode "actboy168.lua-debug"
vscode "adpyke.codesnap"
vscode "adpyke.vscode-sql-formatter"
vscode "ambar.bundle-size"
vscode "antfu.browse-lite"
vscode "antfu.iconify"
vscode "antfu.slidev"
vscode "apollographql.vscode-apollo"
vscode "artdiniz.quitcontrol-vscode"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "bbenoist.nix"
vscode "bierner.markdown-mermaid"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "castwide.solargraph"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "circledev.glsl-canvas"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "csstools.postcss"
vscode "dan-c-underwood.arm"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "donjayamanne.python-environment-manager"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "figma.figma-vscode-extension"
vscode "fill-labs.dependi"
vscode "flowtype.flow-for-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "htmlhint.vscode-htmlhint"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "james-yu.latex-workshop"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jock.svg"
vscode "jscearcy.rust-doc-viewer"
vscode "kamadorueda.alejandra"
vscode "kevinrose.vsc-python-indent"
vscode "koichisasada.vscode-rdbg"
vscode "leetcode.vscode-leetcode"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mariusalchimavicius.json-to-ts"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mongodb.mongodb-vscode"
vscode "mrjjot.vscode-glsl-linter"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-iot.vscode-ros"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "msysyamamoto.vscode-digdag"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "mtxr.sqltools-driver-sqlite"
vscode "mushan.vscode-paste-image"
vscode "myriad-dreamin.tinymist"
vscode "natizyskunk.sftp"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "patricklee.vsnotes"
vscode "pkief.material-icon-theme"
vscode "posit.shiny"
vscode "postman.postman-for-vscode"
vscode "prisma.prisma"
vscode "quarto.quarto"
vscode "redhat.ansible"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rogalmic.bash-debug"
vscode "rowewilsonfrederiskholme.wikitext"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "shuworks.vscode-table-formatter"
vscode "slevesque.shader"
vscode "sorbet.sorbet-vscode-extension"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "suhelmakkad.shadcn-ui"
vscode "sukumo28.wav-preview"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "swellaby.vscode-rust-test-adapter"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "tonybaloney.vscode-pets"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vsls-contrib.gistfs"
vscode "vue.volar"
vscode "wakatime.vscode-wakatime"
vscode "xyc.vscode-mdx-preview"
vscode "yoavbls.pretty-ts-errors"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zignd.html-css-class-completion"
